# Домашнее задание 1: Анализ тональности
Дедлайн: **07.12.2024 23:59**
В данном задании нужно будет сравнить три способа анализу тональности, а именно rule-based подход, ML-подход с кастамизацией модели под наши данные и готовую модельку с с Hugging Face, без кастомизации и дообучения, проанализировать ошибки каждого из методов и выявить «фаворита». 


## Данные

[Датасет кинопоиска](https://huggingface.co/datasets/blinoff/kinopoisk)

Сразу в pandas можно прочитать вот так:
```
import pandas as pd
df = pd.read_json("hf://datasets/blinoff/kinopoisk/kinopoisk.jsonl", lines=True)
```

## Задание

1. (4 балла) Реализовать **rule-based подход** к задаче:
    - (1 балл) Выбрать тональный лексикон, составить набор дополнительных правил (скорее всего, они будут про синтаксические связи и части речи). Прокомментировать сделанный выбор
    - (0.5 балла за ручной вариант, 1 балл за автоматический) Расширить лексикон специфическими для домена словами
    - (2 балла) Реализовать логику применения всего вышеперечисленного. Скорее всего вам понадобиться учесть следующие вещи: взвешивание вклада негативных и позитивных слов, приоритет правил
2. (3 балла) Реализовать **ML-подход.** Тут есть два варианта:
    - Что-то из классических ML алгоритмов (библиотека sklearn). Обратите внимание, что здесь необходимо реализовать корректную предобработку данных, а также подбор параметров выбранного алгоритма (например, через grid search)
    - Нейросети. Здесь обязательно должен быть этап обучения и кастомизации (к примеру, как в видео с предыдущего семинара).  Просто взять готовую модель не подойдет. 
3. (1 балл) Выбрать **готовую модель** для предсказания тональности с Hugging Face и получить ее оценки для текстов датасета
4. (2 балла) 
- Выбрать метрику качества и объяснить сделанный выбор. 
- Подсчитать метрику на результатах работы каждого из подходов, провести анализ ошибок.
- Прокомментировать полученные результаты, сравнить качество и ошибки различных подходов. 
**NB!** Обратите внимание, что без комментария этот пункт засчитан не будет

**Ссылка на GiHub Classroom:** TBA

